// Ограничение времени - 1 секунда
// Ограничение память - 256Mb
// Koд 5 2 E

// Домашний питомец мальчика Васи — улитка Петя. Петя обитает на бесконечном в обе 
// стороны вертикальном столбе, который для удобства можно представить как числовую прямую. 
// Изначально Петя находится в точке 0. Вася кормит Петю ягодами. У него есть n
//  ягод, каждая в единственном экземпляре. Вася знает, что если утром он даст Пете ягоду 
// с номером i, то поев и набравшись сил, за остаток дня Петя поднимется на a i
// единиц вверх по столбу, но при этом за ночь, потяжелев, съедет на b i
// единиц вниз. Параметры различных ягод могут совпадать. Пете стало интересно, а как оно 
// там, наверху, и Вася взялся ему в этом помочь. Ближайшие n дней он будет кормить 
// Петю ягодами из своего запаса таким образом, чтобы максимальная высота, на которой 
// побывал Петя за эти n дней была максимальной. К сожалению, Вася не умеет программировать, 
// поэтому он попросил вас о помощи. Найдите, максимальную высоту, на которой Петя сможет 
// побывать за эти n дней и в каком порядке Вася должен давать Пете ягоды, чтобы Петя 
// смог её достичь!



// Пример 1

// Ввод         Вывод
// 3            10
// 1 1          2 3 1
// 1 2
// 2 1

// Пример 2

// Ввод         Вывод
// 2            10
// 7 6          2 1
// 7 4


const fs = require('fs');

function main(file) {
    const input = fs.readFileSync(file, 'utf8').toString().trim().split('\n');
    const n = parseInt(input.shift(0));
    const coordinates = input.reduce((acc, curr) => [...acc, curr.split(' ').map(Number)], []);
    let curr = 0;
    let max = -Infinity;

    if (n == 1) {
        max = curr + coordinates[0][0];
        fs.writeFileSync('./output.txt', `${max}\n1`);
        return;
    }
    const coordMap = input.reduce((acc, curr, index) => acc.set(curr.split(' ').map(Number).toString(), index), new Map())
    coordinates.sort((a, b) => (b[0] - b[1]) - (a[0] - a[1]));


    for (let el of coordinates) {
        max = Math.max(max, curr + Number(el[0]));
        curr += el[0] - el[1];
    }

    let seq = coordinates.reduce((acc, curr) => 
        acc += coordMap.get(curr.toString()) + 1 + ' ', '');

    fs.writeFileSync('./output.txt', `${max}\n${seq.trim()}`);
}

main('./input.txt');
